use N;

insert into categories(category_name) values ('Кодекс наставника'), ('Памятка наставника'), ('Инструменты наставника'), ('Материалы для наставляемых'), ('Полезная литература'), ('Электронные курсы для наставников');


insert into themes(category_id, theme_name, theme_text) values (1,'Кодекс наставника','1. Постоянно работайте над повышением своего профессионального и культурного уровня. 
2. Будьте примером. Все, что вы требуете от наставляемого, вы должны знать и уметь сами. 
3. Не забывайте, что наставник является руководителем процесса обучения, а не руководителем наставляемого. 
4. Ведите диалог с наставляемым на равных, будьте дипломатичны. 
5. Не говорите плохо о государственном органе и руководстве. Будьте лояльны по отношению к государству.
6. Не обсуждайте с наставляемым личные качества и недостатки ваших коллег и руководителей. 
7. Не обсуждайте со своими коллегами личные качества и недостатки ваших подопечных. 
8. Четко и понятно формулируйте задачи. 
9. Правильно распределяйте время работы. 
10. Комбинируйте различные способы обучения. Больше практики! 
11. Творчески подходите к выполнению своей работы. 
12. Всегда давайте обратную связь, как положительную, так и отрицательную. 
13. Оценивайте не личность наставляемого, а проделанную им работу. 
14. Хвалите наставляемого, если проделанная им работа заслуживает одобрения. 
15. Уважайте мнение наставляемого. 
16. Не бойтесь признавать свои ошибки. 
17. Помогайте наставляемому преодолевать возникающие трудности.
18. Не допускайте, чтобы ваше плохое настроение сказывалось на работе с наставляемым.

Наставничество может быть организовано формально в соответствии с разработанными в государственном органе методическими рекомендациями об организации наставничества, а может проходить неформально и становиться естественной частью организационной культуры.

<b>Помните, что именно Вам поручена ответственная и непростая задача по адаптации сотрудника в государственном органе, и именно от Вас зависит, насколько удачно сотрудник вольется в коллектив</b>
'), (
5, "Полезная литература", "Список"
), (
6, "Электронные курсы для наставников", "Ссылка: https://rsv.ru/education/course/1/240/?search=%D0%BD%D0%B0%D1%81%D1%82%D0%B0%D0%B2%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE"
);

insert into themes(category_id, theme_name, theme_text, theme_file_url) values (
2,"Памятка наставнику","Перед Вами стоит интересная и творческая задача – помочь новому коллеге познакомиться с государственным органом, включиться в рабочий процесс, создать для него комфортную и дружескую атмосферу. В этом Вам помогут рекомендации, представленные ниже.
Наставником является гражданский служащий или иное лицо, назначаемое ответственным за профессиональную и должностную адаптацию лица, в отношении которого осуществляется наставничество, в государственном органе.
Поступление на государственную гражданскую службу или переход в другой государственный орган неизбежно сопровождается определенным периодом адаптации. Задача наставника заключается в том, чтобы помочь новому гражданскому служащему, особенно молодому, почувствовать себя комфортно в новом коллективе, разъяснить ему организационную структуру и порядок служебного взаимодействия, связанный с исполнением должностных обязанностей, а также передать лицу, в отношении которого осуществляется наставничество, опыт и знания по области и виду профессиональной служебной деятельности, необходимые для выполнения его должностных обязанностей, моральные ценности государственного органа и приоритеты государственно-служебной культуры.
Рекомендации по первичной адаптации лица, в отношении которого осуществляется наставничество:
- Расскажите вашему новому коллеге, какая форма обращения принята в Вашем подразделении.
- Расскажите сотруднику о государственном органе, о структурном подразделении в котором Вы работаете, об особенностях работы государственного органа, об особенностях прохождения гражданской службы в государственном органе. Последнее будет особенно интересно для сотрудников впервые поступивших на гражданскую службу.
- Ознакомьте сотрудника с разделами сайта государственного органа. Научите работать с ними.
- Проявите интерес к личности нового сотрудника. Спросите его об образовании, о предыдущем месте работы, семье, достижениях.
- Пообедайте вместе с новым сотрудником в его первый рабочий день.
- Окажите сотруднику помощь в прохождении в здание государственного органа, в заказе временных пропусков для входа в здание государственного органа, пока его удостоверение или пропуск находится в процессе оформления.
- Посоветуйте новому сотруднику ознакомиться с методическими рекомендациями об организации наставничества в (наименование государственного органа) и со справочником для сотрудника «Первые шаги в (наименование государственного органа)». Информация, содержащаяся в данных документах, будет очень полезной для лица, в отношении которого осуществляется наставничество.
- При поручении первых заданий сотруднику спросите, как продвигается их выполнение и окажите помощь в случае возникновения затруднений.
- Будьте доброжелательны к новому сотруднику и внимательны к его нуждам. Будьте готовы отвечать на все возникающие вопросы. Проявляйте терпение и уважение.
Рекомендации для наставника по общению при осуществлении наставничества:
- Старайтесь использовать скорее проблемно-ориентированные, чем личностно-ориентированные утверждения, то есть обращайте большее внимание на поступки и старайтесь давать характеристику событиям и поступкам наставляемого, а не его личности. Используйте описательные, а не оценочные высказывания. Будьте объективны в описании возникающих ситуаций, а также независимы в своих оценках событий и их последствий. Предлагайте приемлемые альтернативы.
- При общении с наставляемым старайтесь подчеркивать его самостоятельность и уважение к нему, проявлять гибкость, непредвзятость и открытость новым идеям. Стремитесь не к доминированию, а к равноправному двухстороннему обмену информацией. Определите области взаимного согласия или позитивные характеристики собеседника прежде, чем говорить о возможных разногласиях или негативных характеристиках. Сформулируйте у нового сотрудника позитивное отношение к работе и коллективу, поддержите энтузиазм сотрудника и уверенность в себе, найдите повод, чтобы его похвалить.
- В ходе обучения делайте особый акцент на сферах, подконтрольных вашему собеседнику, а не на тех факторах, которые не могут быть изменены, или находятся вне сферы его компетенции.
- Ваши утверждения должны отражать Ваше мнение, то есть быть основаны на личном опыте профессиональной служебной деятельности. Старайтесь не заменять слово «я» безликим понятием «руководство», что будет способствовать поддержанию на высоком уровне именно Вашего авторитета как наставника и профессионала.
- Демонстрируйте поддерживающее выслушивание собеседника. Обеспечивайте контакт «глаза в глаза» и применяйте навыки невербального общения. Используйте те или иные реакции в зависимости от того, к какому типу может быть отнесена данная ситуация: к наставничеству или к консультированию.
- Помните, что задача наставничества состоит в стабилизации кадрового состава, поэтому с наставляемым Вам, возможно, предстоит совместно проходить гражданскую службу еще долгое время. Соответственно, успешная модель отношений с наставляемым является залогом Вашего профессионального и должностного роста.","Памятка наставника.docx"
);

insert into themes(category_id, theme_name, theme_text) values (
3, "Список обязательных нормативных правовых актов для ознакомления наставляемым", "<b>Примерный список нормативных правовых актов, обязательных для ознакомления гражданским служащим, в отношении которого осуществляется наставничество</b>

1.	Конституция Российской Федерации от 12 декабря 1993 г.;
2.	Федеральный закон от 27 мая 2003 г. № 58-ФЗ «О системе государственной службы Российской федерации»;
3.	Федеральный закон от 27 июля 2004 г. № 79-ФЗ «О государственной гражданской службе Российской Федерации»;
4.	Федеральный закон от 25 декабря 2008 г. № 273-ФЗ «О противодействии коррупции»;
5.	Указ Президента Российской Федерации от 25 июля 2006 г. № 763 «О денежном содержании федеральных государственных гражданских служащих»;
6.	Указ Президента Российской Федерации от 1 февраля 2005 г. № 112 «О конкурсе на замещение вакантной должности государственной гражданской службы Российской Федерации»;
7.	Указ Президента Российской Федерации от 1 марта 2017 г. № 96 «Об утверждении Положения о кадровом резерве федерального государственного органа»;
8.	Указ Президента Российской Федерации от 1 февраля 2005 г. № 111 «О порядке сдачи квалификационного экзамена государственными гражданскими служащими Российской Федерации и оценки их знаний, навыков и умений (профессионального уровня)»;
9.	Указ Президента Российской Федерации от 21 февраля 2019 г. № 68 
«О профессиональном развитии государственных гражданских служащих Российской Федерации»;
10.	Указ Президента Российской Федерации № 113 от 1 февраля 2005 г. «О порядке присвоения и сохранения классных чинов государственной гражданской службы Российской Федерации федеральным государственным гражданским служащим»;
11.	Указ Президента Российской Федерации от 1 февраля 2005 г. № 110 «О проведении аттестации государственных гражданских служащих Российской Федерации»;
12.	Указ Президента Российской Федерации от 16 февраля 2005 г. № 159 «О примерной форме служебного контракта о прохождении государственной гражданской службы Российской Федерации и замещении должности государственной гражданской службы»;
13.	Указ Президента Российской Федерации от 31 декабря 2005 г. № 1574 «О реестре должностей федеральной государственной службы»;
14.	Постановление Правительства Российской Федерации от 31 марта 2018 г. № 397 «Об утверждении единой методики проведения конкурсов на замещение вакантных должностей государственной гражданской службы Российской Федерации и включение в кадровый резерв государственных органов»;
15.	Постановление Правительства Российской Федерации от 7 октября 2019 г. № 1296 «Об утверждении Положения о наставничестве на государственной гражданской службе Российской Федерации»;
16.	Постановление Правительства Российской Федерации от 15 января 2020 г. № 9 «Об утверждении единой методики прохождения испытания на государственной гражданской службе Российской Федерации в федеральных органах исполнительной власти»;
17.	Методические материалы Минтруда России по вопросам развития гражданской службы, размещенные на официальном сайте по адресу: https://rosmintrud.ru/ministry/programms/gossluzhba/16;
18.	Внутренние регламентирующие документы;
19.	Кодекс этики и служебного поведения государственных гражданских служащих государственного органа;
20.	Административные регламенты государственного органа;
21.	Должностной регламент гражданского служащего;
22.	Инструкция по делопроизводству;
23.	Иные нормативно-правовые акты государственного органа/структурного подразделения.
"
), (
3,"Особенности обучения взрослых","<b>Особенности обучения взрослых</b>

<b>•	Взрослые любят видеть свои результаты</b>
Дайте возможность подопечному оценивать изменение уровня своей подготовки 
<b>•	Взрослым важно знать, как на них повлияют новые знания</b>
Покажите подопечному, в чем именно ему пригодятся новые знания и навыки, сделайте акцент на задачах, которые подопечный сможет быстрее решать после завершения наставничества
<b>•	Взрослые ценят реальные профессиональные примеры</b>
Используйте случаи из рабочей практики, а не абстрактную теорию
<b>•	Взрослые имеют свой прошлый опыт</b>
Относитесь с уважением и вниманием к прошлому опыту подопечного, давайте ему высказаться, проявляйте внимание к его мнению
"
), (
4, "Первые шаги", "Скачать файл"
), (
4,'Рекомендации наставляемым','<b>Качества, которые помогут достичь успеха:</b>
•	Стремление к расширению своих возможностей и ориентация на достижение результата;
•	Понимание своих личных и профессиональных целей, потребностей и желаний. Подопечные несут ответственность за свое решение, поэтому они должны четко понимать, что они хотят получить в итоге;
•	Готовность обратиться за помощью, не бояться своих слабых сторон, исследовать различные пути решения и перспективы. Подопечные должны быть открытыми и обладать жаждой знаний, не бояться идти другой дорогой. 
•	Адекватное восприятие обратной связи, а также действие в соответствии с рекомендациями наставника;
•	Ответственность и дисциплина. В противном случае наставничество не принесет никаких результатов;
•	Взаимодействие с наставником на регулярной основе.

<b>Преимущества наставничества для наставляемого:</b>
•	Возможность получить знания от опытного коллеги;
•	Помощь и поддержка в период адаптации;
•	Комфортная интеграция в корпоративную среду;
•	Возможность получать обратную связь о своей работе;
•	Сокращение времени на освоение должностных обязанностей и функций.
');

insert into themes(category_id, theme_name) values (3, 'Форма индивидуального плана мероприятий по наставничеству');

select * from themes;

insert into subthemes(theme_id, subtheme_name, subtheme_file_url) values (4, 'Наставляемый впервые поступил на гражданскую государственную службу', 'static/downloads/Индивидуальный_план_мероприятий_по_наставничеству_для_впервые_поступившего.docx'), (4, 'Наставляемый ранее уже замещал должность на гражданской государственной службе', 'static/downloads/Индивидуальный_план_мероприятий_по_наставничеству_для_ранее_уже.docx');